{
  "backend/main.mo": "Main Motoko actor defining data types (Tournament, Room, User, etc.) and sample data for a Free Fire tournament platform, with access control and user registration logic.",
  "backend/migration.mo": "Migration module that upgrades the actor state by adding a `walletBalance` field (defaulting to 0.0) to all existing User records.",
  "feature_evidence.json": "Feature evidence report mapping implemented feature IDs and titles to their corresponding source files, components, and test IDs for the tournament platform.",
  "frontend-file-summaries.txt": "JSON document containing one-to-two sentence summaries of each frontend source file, serving as a reference for the project's frontend structure and component responsibilities.",
  "frontend/index.css": "Tailwind base CSS file defining OKLCH-based CSS custom properties for light and dark theme color tokens used throughout the app.",
  "frontend/index.html": "Minimal HTML entry point titled 'Free Fire Tournament' that mounts the React app via a root div and loads the main TSX module.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with all application routes (welcome, login, signup, lobby, register, profile, rules), applying auth guards that redirect unauthenticated users to '/'.",
  "frontend/src/components/Contact.tsx": "Contact section component rendering WhatsApp and Discord join buttons, social media icon links (YouTube, Instagram, Facebook), and a support email with gaming-themed dark red styling.",
  "frontend/src/components/CountdownTimer.tsx": "A React countdown timer component that accepts a target date and displays days, hours, minutes, and seconds in styled boxes with red accents, updating every second.",
  "frontend/src/components/Hero.tsx": "The landing page hero section displaying the tournament headline, prize pool info, a countdown timer to the next tournament date, and a register CTA button with scroll navigation.",
  "frontend/src/components/LandingGate.tsx": "A full-screen entry gate component with a dark themed UI that presents login and register navigation options before the user enters the app.",
  "frontend/src/components/Leaderboard.tsx": "Displays a sorted leaderboard fetched via a query hook, featuring a top-3 podium with medal styling and a ranked list of all players with their points.",
  "frontend/src/components/Navbar.tsx": "A fixed top navigation bar with scroll-aware styling, smooth-scroll section links, authentication-aware home routing, and a register CTA button with a mobile hamburger menu.",
  "frontend/src/components/RegistrationForm.tsx": "A tournament registration form that collects player name, in-game ID, team name, and WhatsApp number, validates inputs, and submits via a mutation hook with success and error feedback.",
  "frontend/src/components/RoomCard.tsx": "Displays a game room card with room type, join status, countdown timer, and slot fill progress, navigating to '/register' on join click.",
  "frontend/src/components/SecurePayment.tsx": "Renders a payment section showing a UPI ID with a copy-to-clipboard button and QR code hint for tournament entry fee collection.",
  "frontend/src/components/TournamentCard.tsx": "Displays a single tournament's details (name, date, entry fee, prize pool) with a 'JOIN NOW' button that navigates to '/register'.",
  "frontend/src/components/TournamentsList.tsx": "Fetches and renders a grid of TournamentCard components with loading skeletons, error state, and empty state handling.",
  "frontend/src/components/WhatsAppChannelBanner.tsx": "Renders a styled WhatsApp channel link button that directs users to join a channel for room ID and password updates.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an ICP backend actor (authenticated or anonymous) using React Query, reinitializing and invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useAuth.ts": "Provides simple localStorage-backed authentication state management with setAuth and clearAuth helpers.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity React context provider and hook that manages AuthClient lifecycle, login/logout, and identity persistence across page reloads.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching tournaments, leaderboard, rooms, wallet balance, and mutations for player/user registration, login, deposit, and withdrawal via the backend actor.",
  "frontend/src/index.css": "Global CSS file that imports Google Fonts, sets up Tailwind base/components/utilities, defines CSS custom properties for theming, and adds custom utility classes and keyframe animations for the game UI.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/LobbyPage.tsx": "Lobby page displaying filterable game rooms with a header, WhatsApp banner, and navigation to profile; redirects unauthenticated users to the home page.",
  "frontend/src/pages/LoginPage.tsx": "Login page with email/password form that authenticates users via the backend and navigates to the lobby on success, displaying appropriate validation and error messages.",
  "frontend/src/pages/ProfilePage.tsx": "Profile page showing user info and wallet balance with deposit/withdraw functionality, including copy-to-clipboard for the Free Fire UID.",
  "frontend/src/pages/RegisterPage.tsx": "Tournament registration page that renders a SecurePayment component alongside a RegistrationForm in a two-column layout with a sticky header and back navigation.",
  "frontend/src/pages/Rules.tsx": "Displays the tournament rules and regulations page, including 10 gameplay rules and a points table mapping placement ranks to scoring values for a Free Fire squad tournament.",
  "frontend/src/pages/SignUpPage.tsx": "Registration page that collects user details (name, email, WhatsApp, Free Fire UID, password), validates inputs, calls the register mutation, and redirects to the lobby on success.",
  "frontend/src/pages/WelcomePage.tsx": "Landing/welcome page featuring a Free Fire character hero image, branding header, tagline, and navigation buttons to sign up or log in for the tournament.",
  "frontend/src/utils/urlParams.ts": "Utility module providing helper functions to read URL query parameters (supporting both standard and hash-based routing), persist them in sessionStorage, and clean sensitive params from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with gaming-specific colors (game-red, game-black, gold, silver), custom fonts (Orbitron, Rajdhani), box shadows, and animations for the tournament UI.",
  "project_state.json": "Tracks the project state for a tournament lobby app, including existing features (profile icon, wallet system, registration/payment flow, back navigation) and new feature requests with architectural notes."
}