{
  "backend/main.mo": "Main Motoko actor defining core data types (Tournament, Room, User, Transaction) and backend logic for a Free Fire tournament platform, including sample data, deposit/transaction management, and imports for authorization, blob storage, and user approval mixins.",
  "feature_evidence.json": "Feature evidence report mapping specific UPI payment flow fix requirements (no auto-advance, no premature timeout, correct URI construction, manual verify button) to their implementation file ManualDepositModal.tsx with associated component dependencies and test IDs.",
  "frontend-file-summaries.txt": "JSON document containing one-to-two sentence summaries of all frontend source files, serving as a reference index for the project's React components, pages, hooks, and configuration files.",
  "frontend/index.css": "Tailwind CSS entry file defining OKLCH-based CSS custom properties for light and dark theme color tokens (background, foreground, card, sidebar, chart colors, etc.) used throughout the UI.",
  "frontend/index.html": "Minimal HTML shell for the React SPA, setting the page title to 'Free Fire Tournament' and mounting the app via a root div and module script pointing to src/main.tsx.",
  "frontend/src/App.tsx": "Root React application component that configures TanStack Router with all routes (welcome, login, signup, lobby, register, profile, rules, and a hidden admin route), wraps everything in React Query's QueryClientProvider, and enforces auth guards via localStorage checks.",
  "frontend/src/components/Contact.tsx": "Contact section component rendering WhatsApp and Discord community join buttons plus YouTube, Instagram, and Facebook social icon links, all styled with the gaming dark-red aesthetic and opening in new tabs.",
  "frontend/src/components/CountdownTimer.tsx": "A React countdown timer component that displays days, hours, minutes, and seconds remaining until a target date, updating every second with a styled red/dark UI.",
  "frontend/src/components/Hero.tsx": "The landing page hero section displaying tournament branding, prize pool info, a countdown timer to the next tournament, and a register CTA button with scroll navigation.",
  "frontend/src/components/LandingGate.tsx": "A full-screen entry gate component with Free Fire Tournament branding that presents Login and Register navigation options before the user enters the app.",
  "frontend/src/components/Leaderboard.tsx": "Displays a sorted leaderboard fetched via React Query, showing a top-3 podium and a ranked table of players with points, loading skeletons, and error states.",
  "frontend/src/components/ManualDepositModal.tsx": "A multi-step modal for manual UPI wallet deposits that guides the user through entering an amount, launching a UPI payment intent, and submitting a 12-digit UTR transaction ID for verification.",
  "frontend/src/components/Navbar.tsx": "A fixed responsive navigation bar with scroll-aware styling, smooth-scroll section links, auth-aware home navigation, and a Register CTA button with a mobile hamburger menu.",
  "frontend/src/components/RegistrationForm.tsx": "A tournament registration form component with fields for player name, in-game ID, team name, and WhatsApp number, including client-side validation and submission via the useRegisterPlayer mutation hook.",
  "frontend/src/components/RoomCard.tsx": "Displays a game room card with room type, join status, a live countdown timer to start time, slot fill progress bar, and a join button that navigates to the registration page.",
  "frontend/src/components/SecurePayment.tsx": "A payment section component that displays a UPI ID for tournament entry fee payment, with a copy-to-clipboard button and a QR code icon.",
  "frontend/src/components/TournamentCard.tsx": "Renders a single tournament card showing name, date/time, entry fee, prize pool, and a join button that navigates to the registration route.",
  "frontend/src/components/TournamentsList.tsx": "Fetches and displays a grid of TournamentCard components with loading skeleton and error states, using the useGetTournaments query hook.",
  "frontend/src/components/WhatsAppChannelBanner.tsx": "A styled banner link that directs users to a WhatsApp channel for receiving room IDs and passwords, with hover animation effects.",
  "frontend/src/hooks/useActor.ts": "A hook that creates and caches an ICP backend actor using TanStack Query, supporting both anonymous and authenticated (Internet Identity) access, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useAuth.ts": "A simple localStorage-backed authentication state hook that stores and retrieves user name, email, and UID with set and clear methods.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication on the ICP platform, managing login state, identity persistence, and AuthClient lifecycle.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend actor interactions including tournaments, leaderboard, rooms, player registration, wallet operations, and deposit/withdrawal management.",
  "frontend/src/index.css": "Global stylesheet importing Orbitron/Rajdhani fonts, defining Tailwind CSS layers with a dark gaming theme (red accents, grid patterns, glow effects, and custom animations).",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrapping the root App component.",
  "frontend/src/pages/AdminPage.tsx": "Admin panel page that displays pending deposit transactions and allows admins to approve or reject them, with access gated by an on-chain admin check.",
  "frontend/src/pages/LobbyPage.tsx": "Authenticated lobby page showing filterable game rooms by type (solo, duo, squad, etc.) with a header, WhatsApp banner, and navigation to profile.",
  "frontend/src/pages/LoginPage.tsx": "Login page that authenticates users by checking locally stored credentials and verifying account existence on-chain, then redirects to the lobby on success.",
  "frontend/src/pages/ProfilePage.tsx": "Displays the authenticated user's profile page with account details, wallet balance, deposit modal, and withdrawal functionality. Redirects unauthenticated users to the home route.",
  "frontend/src/pages/RegisterPage.tsx": "Renders the tournament registration page with a two-column layout containing a SecurePayment component and a RegistrationForm component. Includes a sticky header with back navigation.",
  "frontend/src/pages/Rules.tsx": "Defines and renders the tournament rules and points table as a styled static page section. Contains gameplay rules data and a rank-based points scoring table.",
  "frontend/src/pages/SignUpPage.tsx": "Provides a sign-up form with fields for name, email, WhatsApp, Free Fire UID, and password, with validation and local credential storage. On success, sets auth state and navigates to the lobby.",
  "frontend/src/pages/WelcomePage.tsx": "Renders the landing/welcome page with a Free Fire character image, branding, feature highlights, and navigation buttons to sign up or log in. Uses a dark themed layout with red accent styling.",
  "frontend/src/utils/urlParams.ts": "Provides utility functions for reading URL query parameters from both standard and hash-based routing, persisting them in sessionStorage, and cleaning sensitive params from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, extending the default theme with custom gaming colors (red, black, gold), custom fonts (Orbitron, Rajdhani, Inter), box shadows, animations, and integrating typography, container-queries, and animate plugins.",
  "project_state.json": "Tracks the current project state including version, architectural notes, known issues (UPI Intent closing prematurely), existing implemented features, and pending fix requests related to UPI payment flow in ManualDepositModal.tsx."
}