{
  "backend/main.mo": "Motoko actor defining Tournament, Registration, and LeaderboardEntry types with sample data, and exposing query/update endpoints for getTournaments, registerPlayer, and getLeaderboard.",
  "feature_evidence.json": "Feature evidence report confirming the SecurePayment component was implemented in SecurePayment.tsx and inserted into App.tsx before RegistrationForm, with high confidence.",
  "frontend-file-summaries.txt": "JSON map of all frontend source files to one-line descriptions, serving as a reference index for the project's component and configuration files.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH CSS custom properties for light and dark theme color tokens used throughout the app.",
  "frontend/index.html": "Minimal HTML entry point that mounts the React app into a root div and loads the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component that composes Navbar, Hero, TournamentsList, SecurePayment, RegistrationForm, Rules, Leaderboard, Contact, and a Footer with branding and nav links.",
  "frontend/src/components/Contact.tsx": "Contact section with WhatsApp and Discord join buttons plus YouTube, Instagram, and Facebook social links, all styled with the red/black Free Fire theme.",
  "frontend/src/components/CountdownTimer.tsx": "Countdown timer component that recalculates days/hours/minutes/seconds every second and renders each unit in a red-accented box with corner decorations.",
  "frontend/src/components/Hero.tsx": "Full-screen hero section for a Free Fire tournament site featuring a background image, dark overlay, countdown timer to the next tournament, and CTA buttons that smooth-scroll to registration and tournament sections.",
  "frontend/src/components/Leaderboard.tsx": "Displays a sorted tournament leaderboard fetched via a React Query hook, showing a top-3 podium with medal styling and a ranked table for remaining entries with loading skeletons and error states.",
  "frontend/src/components/Navbar.tsx": "Fixed navigation bar with smooth-scroll links, active section highlighting based on scroll position, a collapsible mobile menu, and a dynamic background/border that appears after scrolling.",
  "frontend/src/components/RegistrationForm.tsx": "Tournament registration form that collects player name, in-game ID, team name, and WhatsApp number, validates inputs, submits via a React Query mutation, and shows success or error feedback.",
  "frontend/src/components/SecurePayment.tsx": "Payment section that displays a UPI ID for tournament entry fee payment, with a one-click copy-to-clipboard button and a QR code prompt, styled with a dark red theme.",
  "frontend/src/components/TournamentCard.tsx": "Renders a single tournament card with details like date, prize pool, player count, and entry fee type (free/paid), including a register button that scrolls to the registration section.",
  "frontend/src/components/TournamentsList.tsx": "Fetches and displays a grid of TournamentCard components with loading skeletons, error state, and empty state handling using the useGetTournaments hook.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and returns an ICP backend actor using the current Internet Identity, recreating it when the identity changes and invalidating dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing ICP Internet Identity authentication state, including login, logout, and identity persistence via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching tournaments, leaderboard data, and registering players via the backend actor.",
  "frontend/src/index.css": "Global stylesheet importing Google Fonts (Rajdhani, Orbitron, Inter), configuring Tailwind CSS with dark theme CSS variables, and defining custom utility classes and keyframe animations.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/Rules.tsx": "Displays the tournament rules and regulations page, including a list of gameplay rules and a points/placement scoring table for Free Fire squad matches.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for a dark-themed gaming site, extending the default theme with custom fonts (Orbitron, Rajdhani, Inter), oklch-based color tokens, gaming-specific colors (game-red, game-black, game-gold), glow box shadows, and custom keyframe animations.",
  "project_state.json": "Project state descriptor (version 5) for a Free Fire gaming tournament website, documenting existing features such as dark theme, hero section, tournament list, registration form, rules page, leaderboard, and contact sections, along with architectural notes about the dark/mobile-responsive design."
}