{
  "backend/main.mo": "Main actor for the Free Fire tournament backend, defining types (Tournament, Room, User, DepositRecord, etc.) and persistent state with migration support, including sample data for tournaments and leaderboards.",
  "backend/migration.mo": "Migration module that upgrades actor state from OldActor to NewActor by adding a `minimumDepositAmount` field defaulting to 10.0.",
  "feature_evidence.json": "Feature evidence report linking the minimum deposit amount enforcement feature (₹10 validation in ManualDepositModal) to its implementing file and associated test/component metadata.",
  "frontend-file-summaries.txt": "JSON document containing short summaries of all frontend source files, describing each component's purpose, recent changes, and key behaviors.",
  "frontend/index.css": "Tailwind base CSS file defining OKLCH-based CSS custom properties for light and dark themes, covering background, foreground, card, border, chart, and sidebar color tokens.",
  "frontend/index.html": "Minimal HTML entry point for the Free Fire Tournament app, mounting the React app at `#root` and loading `src/main.tsx` as a module.",
  "frontend/src/App.tsx": "Root React app component configuring TanStack Router with routes for welcome, login, signup, lobby, register, profile, rules, and a hidden admin page, with auth guards redirecting unauthenticated users.",
  "frontend/src/components/Contact.tsx": "Contact section component with WhatsApp and Discord join buttons, YouTube/Instagram/Facebook social links, and a support email, all styled with gaming aesthetics and opening in new tabs.",
  "frontend/src/components/CountdownTimer.tsx": "Countdown timer component that calculates and displays days/hours/minutes/seconds until a target date, updating every second with red-accented styled boxes and corner decorations.",
  "frontend/src/components/Hero.tsx": "Landing page hero section displaying the Free Fire Tournament headline, prize pool info, countdown timer, and CTA buttons for registration and scrolling to tournaments.",
  "frontend/src/components/LandingGate.tsx": "Full-screen entry gate component shown before authentication, presenting branding and buttons to navigate to the register or lobby routes.",
  "frontend/src/components/Leaderboard.tsx": "Leaderboard section that fetches and displays sorted player rankings with a top-3 podium and a full ranked list, including loading skeletons and error states.",
  "frontend/src/components/ManualDepositModal.tsx": "Multi-step modal for manual UPI wallet deposits, guiding the user through entering an amount, triggering a UPI payment intent, uploading a screenshot, and submitting the transaction ID.",
  "frontend/src/components/Navbar.tsx": "Fixed top navigation bar with brand logo, smooth-scroll section links, a register CTA, and a responsive mobile menu, with scroll-aware styling changes.",
  "frontend/src/components/RegistrationForm.tsx": "A tournament player registration form with fields for player name, in-game ID, team name, and WhatsApp number, including client-side validation and submission via the useRegisterPlayer mutation hook.",
  "frontend/src/components/RoomCard.tsx": "Displays a game room card with room type, join status, a live countdown timer to start time, slot fill progress bar, and a join button that navigates to the registration page.",
  "frontend/src/components/SecurePayment.tsx": "A payment section component that displays a UPI ID for tournament entry fee payment, with a copy-to-clipboard button and a QR code icon.",
  "frontend/src/components/TournamentCard.tsx": "Renders a single tournament card showing name, date/time, entry fee, prize pool, and a join button that navigates to the registration route.",
  "frontend/src/components/TournamentsList.tsx": "Fetches and displays a grid of TournamentCard components with loading skeleton and error states, using the useGetTournaments query hook.",
  "frontend/src/components/WhatsAppChannelBanner.tsx": "A styled banner link that directs users to a WhatsApp channel for receiving room IDs and passwords, with hover animation effects.",
  "frontend/src/hooks/useActor.ts": "A React hook that creates and caches an ICP backend actor using TanStack Query, supporting both anonymous and authenticated (Internet Identity) configurations, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useAuth.ts": "A simple localStorage-backed authentication hook that stores and retrieves user name, email, and UID, exposing setAuth and clearAuth helpers.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication on the ICP blockchain, managing login state, identity persistence, and AuthClient lifecycle.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend actor interactions including tournaments, leaderboard, rooms, user registration, wallet balance, deposits, and withdrawals.",
  "frontend/src/index.css": "Global stylesheet importing Google Fonts and defining Tailwind base/utility layers with a dark gaming theme including red glow effects, custom animations, and CSS variables.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminPage.tsx": "Admin panel page that displays pending deposit records and allows admins to approve or reject them, with access gated by an on-chain admin check.",
  "frontend/src/pages/LobbyPage.tsx": "Authenticated lobby page showing filterable game rooms by type, with a header containing user info, logout, and navigation to the profile page.",
  "frontend/src/pages/LoginPage.tsx": "Login page that authenticates users by checking locally stored credentials and verifying account existence on-chain, then redirects to the lobby on success.",
  "frontend/src/pages/ProfilePage.tsx": "Displays the authenticated user's profile page with account details, wallet balance, deposit modal, and withdrawal functionality. Redirects unauthenticated users to the home route.",
  "frontend/src/pages/RegisterPage.tsx": "Renders the tournament registration page with a two-column layout containing a SecurePayment component and a RegistrationForm component.",
  "frontend/src/pages/Rules.tsx": "Displays tournament rules and a points/scoring table for the Free Fire Arena, including gameplay regulations and placement point breakdowns.",
  "frontend/src/pages/SignUpPage.tsx": "Provides a user registration form with fields for name, email, WhatsApp, Free Fire UID, and password, saving credentials locally and setting auth state on success.",
  "frontend/src/pages/WelcomePage.tsx": "Renders the landing/welcome page with a Free Fire character image, branding, feature highlights, and navigation buttons to sign up or log in.",
  "frontend/src/utils/urlParams.ts": "Provides utility functions for reading URL query parameters (including hash-based routing), persisting them to sessionStorage, and cleaning sensitive params from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, extending the default theme with custom gaming colors (red, black, gold), custom fonts (Orbitron, Rajdhani, Inter), box shadows, animations, and enabling dark mode with typography, container queries, and animate plugins.",
  "project_state.json": "Tracks project state and feature requests for a payment/wallet app, recording existing features and pending tasks related to updating the minimum deposit amount to ₹10 on both frontend and backend."
}