{
  "backend/main.mo": "Main Motoko actor defining data types (Tournament, Room, User, DepositRecord, etc.) and backend logic for a Free Fire tournament platform, including sample data, registrations, leaderboard, and deposit management with access control and blob storage mixins.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (UPI deep link button, screenshot upload flow, unauthorized error fix) to their affected files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "JSON document containing one-line summaries of all frontend source files, serving as a reference index for the project's React components, pages, hooks, and configuration files.",
  "frontend/index.css": "Base Tailwind CSS entry file defining OKLCH-based CSS custom properties for light and dark themes, including colors for background, foreground, card, sidebar, and chart tokens.",
  "frontend/index.html": "Minimal HTML shell for the React SPA, mounting the app into a `#root` div and loading the TypeScript entry point via a module script tag.",
  "frontend/src/App.tsx": "Root React app using TanStack Router and React Query, defining all routes (welcome, login, signup, lobby, register, profile, rules, and a hidden admin route) with authentication guards that redirect unauthenticated users.",
  "frontend/src/components/Contact.tsx": "Contact section component rendering WhatsApp and Discord community join buttons, YouTube/Instagram/Facebook social links, and a support email with hover animations in a dark gaming aesthetic.",
  "frontend/src/components/CountdownTimer.tsx": "A React countdown timer component that counts down to a target date, updating every second and displaying days, hours, minutes, and seconds in styled boxes with red accents.",
  "frontend/src/components/Hero.tsx": "The landing page hero section displaying tournament branding, prize pool info, a countdown timer to the next tournament, and a register CTA button with scroll navigation.",
  "frontend/src/components/LandingGate.tsx": "A full-screen entry gate component shown before authentication, presenting the brand identity and buttons to navigate to the register or lobby routes.",
  "frontend/src/components/Leaderboard.tsx": "Displays a sorted leaderboard fetched via a query hook, featuring a top-3 podium with medal styling and a ranked list of all players with their points.",
  "frontend/src/components/ManualDepositModal.tsx": "A multi-step modal dialog for adding funds via UPI, guiding the user through entering an amount, launching a UPI deep link, uploading a payment screenshot, and submitting a transaction ID.",
  "frontend/src/components/Navbar.tsx": "A fixed top navigation bar with scroll-aware styling, smooth-scroll section links, auth-aware home navigation, a mobile hamburger menu, and a register CTA button.",
  "frontend/src/components/RegistrationForm.tsx": "A tournament registration form component with fields for player name, in-game ID, team name, and WhatsApp number, including client-side validation and submission via the useRegisterPlayer mutation hook.",
  "frontend/src/components/RoomCard.tsx": "Displays a game room card with room type, join status, a live countdown timer to start time, slot fill progress bar, and a join button that navigates to the registration page.",
  "frontend/src/components/SecurePayment.tsx": "A payment section component that displays a UPI ID for tournament entry fee payment, with a copy-to-clipboard button and a QR code icon.",
  "frontend/src/components/TournamentCard.tsx": "Renders a single tournament card showing name, date/time, entry fee, prize pool, and a join button that navigates to the registration route.",
  "frontend/src/components/TournamentsList.tsx": "Fetches and displays a grid of TournamentCard components with loading skeleton and error states, using the useGetTournaments query hook.",
  "frontend/src/components/WhatsAppChannelBanner.tsx": "A styled banner link that directs users to a WhatsApp channel for receiving room IDs and passwords, with hover animation effects.",
  "frontend/src/hooks/useActor.ts": "A hook that creates and caches an ICP backend actor using TanStack Query, supporting both anonymous and authenticated (Internet Identity) access, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useAuth.ts": "A simple localStorage-backed authentication state hook that stores and retrieves user name, email, and UID with set and clear helpers.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication on the ICP platform, managing login state, identity persistence, and AuthClient lifecycle.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend actor interactions including tournaments, leaderboard, rooms, user registration/login, wallet operations, and deposit management.",
  "frontend/src/index.css": "Global stylesheet importing Google Fonts and Tailwind, defining CSS custom properties for a dark gaming theme with red accents, utility classes, and custom animations.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminPage.tsx": "Admin panel page that displays pending deposit requests and allows admins to approve or reject them, with access gated by an isCallerAdmin check.",
  "frontend/src/pages/LobbyPage.tsx": "Main lobby page showing filterable game rooms after authentication, with a header displaying user info, logout, and a WhatsApp channel banner.",
  "frontend/src/pages/LoginPage.tsx": "Login form page that authenticates users via email and password using the backend actor, then stores auth state and navigates to the lobby on success.",
  "frontend/src/pages/ProfilePage.tsx": "Displays the authenticated user's profile page with account details, wallet balance, deposit/withdrawal functionality, and UID copy feature. Redirects unauthenticated users to the home page.",
  "frontend/src/pages/RegisterPage.tsx": "Tournament registration page that renders a two-column layout with a SecurePayment component and a RegistrationForm component, accessible from the lobby.",
  "frontend/src/pages/Rules.tsx": "Static page displaying Free Fire tournament rules and a points table, including gameplay regulations, conduct policies, and placement/kill point scoring.",
  "frontend/src/pages/SignUpPage.tsx": "User account creation page with a form for name, email, WhatsApp, Free Fire UID, and password fields, handling validation and registration via a mutation hook.",
  "frontend/src/pages/WelcomePage.tsx": "Landing/welcome page featuring a Free Fire character image, branding, and navigation CTAs with a styled hero layout using Tailwind and inline styles.",
  "frontend/src/utils/urlParams.ts": "Utility module providing helper functions to read, store, retrieve, and clear URL parameters from both query strings and hash-based routes, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, extending the default theme with custom gaming colors (red, black, gold), fonts (Orbitron, Rajdhani, Inter), shadows, animations, and integrating typography, container-queries, and animate plugins.",
  "project_state.json": "Project state tracking file describing the FreeFire Tournament app's current features, architectural notes (UPI deep link format, deposit flow), known issues (Unauthorized error), and pending feature requests for UPI intent links and auth fixes."
}