{
  "backend/main.mo": "Main Motoko actor defining Tournament, Registration, Room, User, and Leaderboard types with sample data, access control initialization, and a MixinAuthorization include for role-based auth.",
  "feature_evidence.json": "Feature evidence report mapping implemented feature IDs (router guards, back-button navigation, history stack clearing, navbar links) to their source files, components, and test requirement IDs.",
  "frontend-file-summaries.txt": "JSON document containing one-line summaries of every frontend source file, serving as a human-readable index of each component's purpose and recent changes.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH CSS custom properties for light and dark color themes used by shadcn-ui components throughout the app.",
  "frontend/index.html": "Minimal HTML entry point that mounts the React app into a `#root` div and loads the TypeScript module entry point `src/main.tsx`.",
  "frontend/src/App.tsx": "TanStack Router setup defining all application routes with `beforeLoad` auth guards that redirect authenticated users to `/lobby` and unauthenticated users away from protected routes, plus a shared Footer component.",
  "frontend/src/components/Contact.tsx": "Contact section component rendering WhatsApp and Discord join buttons alongside YouTube, Instagram, and Facebook social links, all opening in new tabs with hover color effects.",
  "frontend/src/components/CountdownTimer.tsx": "A React countdown timer component that counts down to a target date, updating every second and displaying days, hours, minutes, and seconds in styled boxes with red accents.",
  "frontend/src/components/Hero.tsx": "The landing page hero section displaying tournament branding, prize pool info, a countdown timer to the next tournament, and a register CTA button with scroll-down navigation.",
  "frontend/src/components/LandingGate.tsx": "A full-screen entry gate component shown before authentication, presenting the Free Fire Tournament brand with Login and Register navigation buttons.",
  "frontend/src/components/Leaderboard.tsx": "Displays a tournament leaderboard fetched via a query hook, showing a top-3 podium and a ranked table of players sorted by total points with loading and error states.",
  "frontend/src/components/Navbar.tsx": "A fixed top navigation bar with scroll-aware styling, smooth-scroll section links, auth-aware home navigation, a mobile hamburger menu, and a Register CTA button.",
  "frontend/src/components/RegistrationForm.tsx": "A tournament registration form that collects player name, in-game ID, team name, and WhatsApp number, validates inputs, submits via a mutation hook, and shows success or error feedback.",
  "frontend/src/components/RoomCard.tsx": "Displays a game room card with room type, join status, a live countdown timer to start time, and a slot fill progress bar. Navigates to '/register' when the join button is clicked.",
  "frontend/src/components/SecurePayment.tsx": "Renders a payment section showing a UPI ID with a copy-to-clipboard button and a QR code hint for tournament entry fee collection.",
  "frontend/src/components/TournamentCard.tsx": "Displays a single tournament's details (name, date, prize pool, slots, entry fee) with a styled card and a register button that navigates to '/register'.",
  "frontend/src/components/TournamentsList.tsx": "Fetches and renders a grid of TournamentCard components with loading skeletons, an error state, and an empty state message.",
  "frontend/src/components/WhatsAppChannelBanner.tsx": "Renders a styled anchor button linking to a WhatsApp channel where room IDs and passwords are shared.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an ICP backend actor (authenticated or anonymous) using React Query, reinitializing and invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useAuth.ts": "Manages simple localStorage-backed authentication state (name, email, isAuthenticated) with setAuth and clearAuth helpers.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication using DFINITY's AuthClient, exposing login/logout functions, identity state, and login status.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching tournaments, leaderboard, and rooms, as well as mutations for registering players, registering users, and logging in users via the backend actor.",
  "frontend/src/index.css": "Global stylesheet importing Google Fonts and Tailwind, defining CSS custom properties for a dark red-accented theme, utility classes, and keyframe animations.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped in QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/LobbyPage.tsx": "Displays a list of tournament rooms fetched from the backend with loading skeletons and error states, and locks browser navigation to prevent returning to auth pages.",
  "frontend/src/pages/LoginPage.tsx": "Login form page that validates email/password inputs, calls the loginUser mutation, stores auth state on success, and navigates to the lobby.",
  "frontend/src/pages/RegisterPage.tsx": "Registration page that composes the RegistrationForm, SecurePayment, and WhatsAppChannelBanner components with a header and footer, always navigating back to the lobby.",
  "frontend/src/pages/Rules.tsx": "Displays the tournament rules and regulations page, including 10 gameplay rules and a points table mapping placement ranks to scoring values.",
  "frontend/src/pages/SignUpPage.tsx": "Registration form page that collects name, email, WhatsApp, Free Fire UID, and password, validates inputs, calls the register mutation, and redirects to the lobby on success.",
  "frontend/src/pages/WelcomePage.tsx": "Landing/welcome page with a gaming-themed hero layout featuring a Free Fire character image, branding header, and navigation buttons to sign up or log in.",
  "frontend/src/utils/urlParams.ts": "Utility module providing helper functions to read URL query parameters (supporting both standard and hash-based routing), persist them in sessionStorage, and clean sensitive params from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom gaming fonts (Orbitron, Rajdhani), game-themed colors (red, black, gold), box shadows, and animations like a red pulse glow.",
  "project_state.json": "Tracks the project state (version 23) for a Free Fire gaming tournament website, documenting architecture, auth flow, existing features, and design decisions including dark red/black theme, Indian Rupee pricing, and a live lobby as the authenticated home screen."
}