{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Lobby Profile & Wallet Menu + Join Now Navigation",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Wire TournamentCard and RoomCard 'Join Now' buttons to navigate to /register",
      "acceptanceCriteria": [
        "Clicking 'Join Now' on any TournamentCard navigates to /register",
        "Clicking the join button on any RoomCard navigates to /register",
        "The Registration/Payment page loads correctly after clicking Join Now"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/TournamentCard.tsx",
          "operation": "modify",
          "description": "Update the register button onClick handler to use router.navigate('/register') to ensure consistent navigation to the registration page when the Join Now button is clicked."
        },
        {
          "path": "frontend/src/components/RoomCard.tsx",
          "operation": "modify",
          "description": "Verify the existing navigation to '/register' on the join button click is working correctly. Ensure the router.navigate call is present and properly wired."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add a User Profile icon button to the top-right corner of LobbyPage header",
      "acceptanceCriteria": [
        "A profile icon is visible at the top-right of the LobbyPage",
        "The icon is styled with the existing dark red/black/gold theme",
        "The icon is tappable and responds to click events"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/LobbyPage.tsx",
          "operation": "modify",
          "description": "Add a header section at the top of the page containing a user profile icon button positioned at the top-right. Use a recognizable user/avatar icon (e.g., from lucide-react icons) styled with the dark red/black/gold gaming theme. Wire the button's onClick to navigate to '/profile'."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Create ProfilePage displaying account details, wallet balance, deposit/withdraw buttons, and terms link",
      "acceptanceCriteria": [
        "Profile menu/page opens when profile icon is clicked",
        "Account Details section shows the player's name and UID from auth/localStorage state",
        "Wallet section shows balance formatted as ₹0.00",
        "Deposit button is visible and styled",
        "Withdraw button is visible and styled",
        "Terms & Conditions link navigates to the rules/tournament rules page"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ProfilePage.tsx",
          "operation": "create",
          "description": "Create a new ProfilePage component that displays: (1) A header with a back button that navigates to '/lobby', (2) Account Details section showing the logged-in user's name and Free Fire UID retrieved from useAuth or localStorage, (3) Wallet section displaying the current balance formatted as ₹0.00 fetched via a query hook calling getWalletBalance(uid), (4) Two action buttons labeled 'Deposit' and 'Withdraw' styled with the dark red/black/gold gaming theme, (5) A 'Terms & Conditions' link that navigates to '/rules'. Style the page consistently with the existing gaming theme using Tailwind classes and the custom color palette."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a new useWalletBalance query hook that calls actor.getWalletBalance(uid) to fetch the current wallet balance for the authenticated user. Include proper loading, error, and enabled states. Also add mutation hooks for deposit and withdraw operations that call actor.deposit(uid, amount) and actor.withdraw(uid, amount), with optimistic updates and query invalidation on success."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Ensure Back button on ProfilePage and RegisterPage always navigates to /lobby",
      "acceptanceCriteria": [
        "Back button on RegisterPage navigates to /lobby",
        "Back button on ProfilePage navigates to /lobby",
        "Pressing the browser back button from these pages does not land on the login or welcome screen"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ProfilePage.tsx",
          "operation": "modify",
          "description": "Ensure the back button uses router.navigate('/lobby', { replace: true }) to force navigation to the lobby and prevent browser back from returning to login/welcome pages. Apply the same navigation lock pattern used in LobbyPage if necessary."
        },
        {
          "path": "frontend/src/pages/RegisterPage.tsx",
          "operation": "modify",
          "description": "Verify the existing back button navigation to '/lobby' is using router.navigate('/lobby', { replace: true }) or equivalent to prevent returning to login/welcome screens. Ensure the navigation lock pattern from LobbyPage is applied consistently."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Add /profile route to TanStack Router configuration with auth guard",
      "acceptanceCriteria": [
        "/profile route is defined in App.tsx",
        "Unauthenticated users visiting /profile are redirected to login/welcome",
        "Authenticated users can access /profile"
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add a new /profile route to the TanStack Router configuration that renders the ProfilePage component. Include the same beforeLoad auth guard pattern used for other protected routes (/lobby, /register) to redirect unauthenticated users to the login or welcome page and allow authenticated users to access the profile."
        }
      ]
    }
  ]
}