{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Make Live Lobby the permanent home for authenticated users",
  "requirements": [
    {
      "id": "REQ-41",
      "summary": "Update App.tsx router configuration so that '/lobby' is the default destination for authenticated users, with automatic redirects from '/', '/login', and '/signup' to '/lobby' when logged in",
      "acceptanceCriteria": [
        "An authenticated user who manually navigates to '/' is immediately redirected to '/lobby'",
        "An authenticated user who manually navigates to '/login' is immediately redirected to '/lobby'",
        "An authenticated user who manually navigates to '/signup' is immediately redirected to '/lobby'",
        "The WelcomePage, LoginPage, and SignUpPage are never rendered for authenticated users",
        "Unauthenticated users are still correctly redirected from '/lobby' to '/' (WelcomePage)"
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add redirect logic to the routes for '/', '/login', and '/signup' so that authenticated users are automatically redirected to '/lobby'. Read the authentication state from the useInternetIdentity hook (identity field). When rendering WelcomePage, LoginPage, or SignUpPage, check if identity exists and redirect to '/lobby' using React Router's Navigate component or useNavigate hook. Ensure the existing auth guard on '/lobby' (redirecting unauthenticated users to '/') continues to work correctly."
        }
      ]
    },
    {
      "id": "REQ-42",
      "summary": "Update the 'Back to Home' button in RegisterPage.tsx to navigate to '/lobby' instead of '/' or any auth screen",
      "acceptanceCriteria": [
        "Clicking 'Back to Home' on RegisterPage navigates the user to '/lobby'",
        "The button does not navigate to '/', '/login', '/signup', or '/home'",
        "Navigation uses React Router (no full page reload)"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/RegisterPage.tsx",
          "operation": "modify",
          "description": "Update the back navigation control in the sticky header to navigate to '/lobby' instead of '/' or any other route. Use React Router's Link component or navigate function to route to '/lobby'. Ensure the navigation label remains appropriate (e.g., 'Back to Lobby' or 'Back to Home')."
        }
      ]
    },
    {
      "id": "REQ-43",
      "summary": "Update LobbyPage.tsx history replacement logic to prevent back-navigation to '/', '/login', '/signup', or '/home'",
      "acceptanceCriteria": [
        "Pressing the browser back button while on LobbyPage does not navigate to WelcomePage, LoginPage, or SignUpPage",
        "Pressing the browser back button while on LobbyPage does not navigate to '/home' or '/'",
        "The history replace strategy on LobbyPage mount prevents any back-navigation to auth screens"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/LobbyPage.tsx",
          "operation": "modify",
          "description": "Enhance the existing useEffect that replaces browser history on mount to cover all auth and landing page routes ('/', '/login', '/signup', '/home'). Use navigate('/', { replace: true }) or a similar strategy to clear the history stack so that pressing the browser back button from the lobby never lands on auth or landing pages. Consider checking window.history state or implementing a more robust history clearing mechanism if needed."
        }
      ]
    },
    {
      "id": "REQ-44",
      "summary": "Update Navbar.tsx so that the 'Home' navigation link redirects authenticated users to '/lobby' instead of '/' or '/home'",
      "acceptanceCriteria": [
        "Clicking the 'Home' Navbar link while authenticated navigates to '/lobby'",
        "No Navbar link routes an authenticated user to '/', '/login', or '/signup'",
        "Other Navbar links (Tournaments, Rules, Leaderboard, Contact) continue to function correctly for authenticated users"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Navbar.tsx",
          "operation": "modify",
          "description": "Update the 'Home' navigation link (and any other links pointing to '/home' or '/') to conditionally route authenticated users to '/lobby'. Read the authentication state from the useInternetIdentity hook (identity field). If the user is authenticated, the home link should navigate to '/lobby'; otherwise, it should navigate to '/' or '/home' as before. Ensure the link remains highlighted correctly when the user is on the lobby page. Verify that other navigation links (Tournaments, Rules, Leaderboard, Contact) are not affected by this change."
        }
      ]
    }
  ]
}